// Задача 4.
//Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

Console.WriteLine("Введите число - >");
int num = int.Parse(Console.ReadLine());

for(int i=0; i<num.length;i++)
{
    if(num[i]%2==0);
}


